<a href="https://colab.research.google.com/github/swilsonmfc/pandas/blob/main/3_Homework.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework Lesson 3

# Setup

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pathlib
from pprint import pprint as pp

# Data

## Download the Data

In [3]:
!wget https://www.postgresqltutorial.com/wp-content/uploads/2019/05/dvdrental.zip
!unzip dvdrental.zip
!tar -xvf dvdrental.tar
!rm toc.dat

--2021-04-30 07:03:25--  https://www.postgresqltutorial.com/wp-content/uploads/2019/05/dvdrental.zip
Resolving www.postgresqltutorial.com (www.postgresqltutorial.com)... 151.139.128.11
Connecting to www.postgresqltutorial.com (www.postgresqltutorial.com)|151.139.128.11|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 550906 (538K) [application/zip]
Saving to: ‘dvdrental.zip’

dvdrental.zip       100%[===================>] 537.99K  --.-KB/s    in 0.04s

2021-04-30 07:03:26 (13.6 MB/s) - ‘dvdrental.zip’ saved [550906/550906]

Archive:  dvdrental.zip
  inflating: dvdrental.tar
toc.dat
3057.dat
3065.dat
3059.dat
3067.dat
3069.dat
3055.dat
3061.dat
3062.dat
3063.dat
3071.dat
3073.dat
3075.dat
3077.dat
3079.dat
3081.dat
restore.sql

## Friendly Tables & Columns

In [4]:
table_name_map = {
  '3057.dat':'actor',
  '3065.dat':'address',
  '3059.dat':'category',
  '3067.dat':'city',
  '3069.dat':'country',
  '3055.dat':'customer',
  '3061.dat':'film',
  '3062.dat':'film_actor',
  '3063.dat':'film_category',
  '3071.dat':'inventory',
  '3073.dat':'language',
  '3075.dat':'payment',
  '3077.dat':'rental',
  '3079.dat':'staff',
  '3081.dat':'store'
}

In [5]:
table_column_map = {
  '3057.dat':['actor_id', 'first_name', 'last_name', 'last_update'],
  '3065.dat':['address_id', 'address', 'address2', 'district', 'city_id', 'postal_code', 'phone', 'last_update'],
  '3059.dat':['category_id', 'name', 'last_update'],
  '3067.dat':['city_id', 'city', 'country_id', 'last_update'],
  '3069.dat':['country_id', 'country', 'last_update'],
  '3055.dat':['customer_id', 'store_id', 'first_name', 'last_name', 'email', 'address_id', 'activebool', 'create_date', 'last_update', 'active'],
  '3061.dat':['film_id', 'title', 'description', 'release_year', 'language_id', 'rental_duration', 'rental_rate', 'length', 'replacement_cost', 'rating', 'last_update', 'special_features', 'fulltext'],
  '3062.dat':['actor_id', 'film_id', 'last_update'],
  '3063.dat':['film_id', 'category_id', 'last_update'],
  '3071.dat':['inventory_id', 'film_id', 'store_id', 'last_update'],
  '3073.dat':['language_id', 'name', 'last_update'],
  '3075.dat':['payment_id', 'customer_id', 'staff_id', 'rental_id', 'amount', 'payment_date'],
  '3077.dat':['rental_id', 'rental_date', 'inventory_id', 'customer_id', 'return_date', 'staff_id', 'last_update'],
  '3079.dat':['staff_id', 'first_name', 'last_name', 'address_id', 'email', 'store_id', 'active', 'username', 'password', 'last_update', 'picture'],
  '3081.dat':['store_id', 'manager_staff_id', 'address_id', 'last_update']
}

## Load Data

In [6]:
# Load each .dat file as a pandas frame adding column headers
data = {str(file): pd.read_csv(file, sep='\t', names=table_column_map[str(file)]) \
      for file in pathlib.Path('.').rglob('*.dat')}

# Remove last row of each table (drop takes the indexes to remove)
data = {name: table.drop(table.tail(1).index) for name, table in data.items()}

# Rename keys for friendly names 
db = {table_name_map[key]:data.pop(key) for key, val in table_name_map.items()}

# Change all id columns to int (rather than floats)
for name, table in db.items():
  for col in table.columns:
    if col.endswith('_id'):
      table[col] = table[col].astype('int') 

pp(db)

{'actor':      actor_id first_name     last_name             last_update
0           1   Penelope       Guiness  2013-05-26 14:47:57.62
1           2       Nick      Wahlberg  2013-05-26 14:47:57.62
2           3         Ed         Chase  2013-05-26 14:47:57.62
3           4   Jennifer         Davis  2013-05-26 14:47:57.62
4           5     Johnny  Lollobrigida  2013-05-26 14:47:57.62
..        ...        ...           ...                     ...
195       196       Bela        Walken  2013-05-26 14:47:57.62
196       197      Reese          West  2013-05-26 14:47:57.62
197       198       Mary        Keitel  2013-05-26 14:47:57.62
198       199      Julia       Fawcett  2013-05-26 14:47:57.62
199       200      Thora        Temple  2013-05-26 14:47:57.62

[200 rows x 4 columns],
 'address':      address_id                   address  ...         phone          last_update
0             1         47 MySakila Drive  ...           NaN  2006-02-15 09:45:30
1             2        28 MySQL Boulevard  ...           NaN  2006-02-15 09:45:30
2             3         23 Workhaven Lane  ...  1.403334e+10  2006-02-15 09:45:30
3             4      1411 Lillydale Drive  ...  6.172236e+09  2006-02-15 09:45:30
4             5            1913 Hanoi Way  ...  2.830338e+10  2006-02-15 09:45:30
..          ...                       ...  ...           ...                  ...
598         601       844 Bucuresti Place  ...  9.359524e+11  2006-02-15 09:45:30
599         602  1101 Bucuresti Boulevard  ...  1.995146e+11  2006-02-15 09:45:30
600         603    1103 Quilmes Boulevard  ...  6.440214e+11  2006-02-15 09:45:30
601         604       1331 Usak Boulevard  ...  1.453087e+11  2006-02-15 09:45:30
602         605      1325 Fukuyama Street  ...  2.882412e+11  2006-02-15 09:45:30

[603 rows x 8 columns],
 'category':     category_id         name          last_update
0             1       Action  2006-02-15 09:46:27
1             2    Animation  2006-02-15 09:46:27
2             3     Children  2006-02-15 09:46:27
3             4     Classics  2006-02-15 09:46:27
4             5       Comedy  2006-02-15 09:46:27
5             6  Documentary  2006-02-15 09:46:27
6             7        Drama  2006-02-15 09:46:27
7             8       Family  2006-02-15 09:46:27
8             9      Foreign  2006-02-15 09:46:27
9            10        Games  2006-02-15 09:46:27
10           11       Horror  2006-02-15 09:46:27
11           12        Music  2006-02-15 09:46:27
12           13          New  2006-02-15 09:46:27
13           14       Sci-Fi  2006-02-15 09:46:27
14           15       Sports  2006-02-15 09:46:27
15           16       Travel  2006-02-15 09:46:27,
 'city':      city_id                city  country_id          last_update
0          1  A Corua (La Corua)          87  2006-02-15 09:45:25
1          2                Abha          82  2006-02-15 09:45:25
2          3           Abu Dhabi         101  2006-02-15 09:45:25
3          4                Acua          60  2006-02-15 09:45:25
4          5               Adana          97  2006-02-15 09:45:25
..       ...                 ...         ...                  ...
595      596               Zaria          69  2006-02-15 09:45:25
596      597        Zeleznogorsk          80  2006-02-15 09:45:25
597      598         Zhezqazghan          51  2006-02-15 09:45:25
598      599            Zhoushan          23  2006-02-15 09:45:25
599      600          Ziguinchor          83  2006-02-15 09:45:25

[600 rows x 4 columns],
 'country':      country_id               country          last_update
0             1           Afghanistan  2006-02-15 09:44:00
1             2               Algeria  2006-02-15 09:44:00
2             3        American Samoa  2006-02-15 09:44:00
3             4                Angola  2006-02-15 09:44:00
4             5              Anguilla  2006-02-15 09:44:00
..          ...                   ...                  ...
104         105               Vietnam  2006-02-15 09:44:00
105         106  Virgin Islands, U.S.  2006-02-15 09:44:00
106         107                 Yemen  2006-02-15 09:44:00
107         108            Yugoslavia  2006-02-15 09:44:00
108         109                Zambia  2006-02-15 09:44:00

[109 rows x 3 columns],
 'customer':      customer_id  store_id  ...              last_update active
0            524         1  ...  2013-05-26 14:49:45.738    1.0
1              1         1  ...  2013-05-26 14:49:45.738    1.0
2              2         1  ...  2013-05-26 14:49:45.738    1.0
3              3         1  ...  2013-05-26 14:49:45.738    1.0
4              4         2  ...  2013-05-26 14:49:45.738    1.0
..           ...       ...  ...                      ...    ...
594          595         1  ...  2013-05-26 14:49:45.738    1.0
595          596         1  ...  2013-05-26 14:49:45.738    1.0
596          597         1  ...  2013-05-26 14:49:45.738    1.0
597          598         1  ...  2013-05-26 14:49:45.738    1.0
598          599         2  ...  2013-05-26 14:49:45.738    1.0

[599 rows x 10 columns],
 'film':      film_id  ...                                           fulltext
0        133  ...  'chamber':1 'fate':4 'husband':11 'italian':2 ...
1        384  ...  'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2          8  ...  'airport':1 'ancient':18 'confront':14 'epic':...
3         98  ...  'boat':20 'bright':1 'conquer':14 'encount':2 ...
4          1  ...  'academi':1 'battl':15 'canadian':20 'dinosaur...
..       ...  ...                                                ...
995      996  ...  'administr':12 'boat':8 'boy':17 'databas':11 ...
996      997  ...  'boat':22 'cat':11 'challeng':14 'drama':5 'ki...
997      998  ...  'boy':16 'canadian':19 'compos':8 'core':2 'fa...
998      999  ...  'ancient':19 'boat':11 'china':20 'discov':14 ...
999     1000  ...  'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona...

[1000 rows x 13 columns],
 'film_actor':       actor_id  film_id          last_update
0            1        1  2006-02-15 10:05:03
1            1       23  2006-02-15 10:05:03
2            1       25  2006-02-15 10:05:03
3            1      106  2006-02-15 10:05:03
4            1      140  2006-02-15 10:05:03
...        ...      ...                  ...
5457       200      879  2006-02-15 10:05:03
5458       200      912  2006-02-15 10:05:03
5459       200      945  2006-02-15 10:05:03
5460       200      958  2006-02-15 10:05:03
5461       200      993  2006-02-15 10:05:03

[5462 rows x 3 columns],
 'film_category':      film_id  category_id          last_update
0          1            6  2006-02-15 10:07:09
1          2           11  2006-02-15 10:07:09
2          3            6  2006-02-15 10:07:09
3          4           11  2006-02-15 10:07:09
4          5            8  2006-02-15 10:07:09
..       ...          ...                  ...
995      996            6  2006-02-15 10:07:09
996      997           12  2006-02-15 10:07:09
997      998           11  2006-02-15 10:07:09
998      999            3  2006-02-15 10:07:09
999     1000            5  2006-02-15 10:07:09

[1000 rows x 3 columns],
 'inventory':       inventory_id  film_id  store_id          last_update
0                1        1         1  2006-02-15 10:09:17
1                2        1         1  2006-02-15 10:09:17
2                3        1         1  2006-02-15 10:09:17
3                4        1         1  2006-02-15 10:09:17
4                5        1         2  2006-02-15 10:09:17
...            ...      ...       ...                  ...
4576          4577     1000         1  2006-02-15 10:09:17
4577          4578     1000         2  2006-02-15 10:09:17
4578          4579     1000         2  2006-02-15 10:09:17
4579          4580     1000         2  2006-02-15 10:09:17
4580          4581     1000         2  2006-02-15 10:09:17

[4581 rows x 4 columns],
 'language':    language_id                  name          last_update
0            1  English               2006-02-15 10:02:19
1            2  Italian               2006-02-15 10:02:19
2            3  Japanese              2006-02-15 10:02:19
3            4  Mandarin              2006-02-15 10:02:19
4            5  French                2006-02-15 10:02:19
5            6  German                2006-02-15 10:02:19,
 'payment':        payment_id  customer_id  ...  amount                payment_date
0           17503          341  ...    7.99  2007-02-15 22:25:46.996577
1           17504          341  ...    1.99  2007-02-16 17:23:14.996577
2           17505          341  ...    7.99  2007-02-16 22:41:45.996577
3           17506          341  ...    2.99  2007-02-19 19:39:56.996577
4           17507          341  ...    7.99  2007-02-20 17:31:48.996577
...           ...          ...  ...     ...                         ...
14591       32094          245  ...    2.99  2007-05-14 13:44:29.996577
14592       32095          251  ...    0.99  2007-05-14 13:44:29.996577
14593       32096          252  ...    4.99  2007-05-14 13:44:29.996577
14594       32097          263  ...    0.99  2007-05-14 13:44:29.996577
14595       32098          264  ...    2.99  2007-05-14 13:44:29.996577

[14596 rows x 6 columns],
 'rental':        rental_id          rental_date  ...  staff_id          last_update
0              2  2005-05-24 22:54:33  ...         1  2006-02-16 02:30:53
1              3  2005-05-24 23:03:39  ...         1  2006-02-16 02:30:53
2              4  2005-05-24 23:04:41  ...         2  2006-02-16 02:30:53
3              5  2005-05-24 23:05:21  ...         1  2006-02-16 02:30:53
4              6  2005-05-24 23:08:07  ...         1  2006-02-16 02:30:53
...          ...                  ...  ...       ...                  ...
16039      16046  2005-08-23 22:26:47  ...         2  2006-02-16 02:30:53
16040      16047  2005-08-23 22:42:48  ...         2  2006-02-16 02:30:53
16041      16048  2005-08-23 22:43:07  ...         1  2006-02-16 02:30:53
16042      16049  2005-08-23 22:50:12  ...         2  2006-02-16 02:30:53
16043          1  2005-05-24 22:53:30  ...         1  2006-02-15 21:30:53

[16044 rows x 7 columns],
 'staff':    staff_id first_name  ...                last_update              picture
0         1       Mike  ...  2006-05-16 16:13:11.79328  \\x89504e470d0a5a0a
1         2        Jon  ...  2006-05-16 16:13:11.79328                   \N

[2 rows x 11 columns],
 'store':    store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-15 09:57:12
1         2                 2           2  2006-02-15 09:57:12}

## Schema
![](https://www.postgresqltutorial.com/wp-content/uploads/2018/03/dvd-rental-sample-database-diagram.png)

# Where do you work?
* Example of the one-many join

In [7]:
# How many staff are there?
len(db['staff'])

2

In [8]:
# How many stores are there?

In [9]:
# How much staff work at each store?

# Who's in what film?
* Multi DataFrame join

In [10]:
# Print the Actors Table
db['actor']

     actor_id first_name     last_name             last_update
0           1   Penelope       Guiness  2013-05-26 14:47:57.62
1           2       Nick      Wahlberg  2013-05-26 14:47:57.62
2           3         Ed         Chase  2013-05-26 14:47:57.62
3           4   Jennifer         Davis  2013-05-26 14:47:57.62
4           5     Johnny  Lollobrigida  2013-05-26 14:47:57.62
..        ...        ...           ...                     ...
195       196       Bela        Walken  2013-05-26 14:47:57.62
196       197      Reese          West  2013-05-26 14:47:57.62
197       198       Mary        Keitel  2013-05-26 14:47:57.62
198       199      Julia       Fawcett  2013-05-26 14:47:57.62
199       200      Thora        Temple  2013-05-26 14:47:57.62

[200 rows x 4 columns]

In [11]:
# Print the film table

In [12]:
# How many films are there?

In [13]:
# Set an index on the actor table using its id
db['actor'] = db['actor'].set_index('actor_id')

In [14]:
# Set an index on the film table using its id

In [15]:
# Set a multi-index on the film_actor table using both film_id and actor_id

In [16]:
# Which actors are in which films

In [17]:
# Show the last 5 items of the actor_film_df

In [18]:
# What's the number of actors in each film?

In [19]:
# What the most actors in a film?

In [20]:
# What was the film?

In [21]:
## Who acted in the film?

# How long have you had that rental?
* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html
* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html

In [22]:
# Look at the row with index 14497

In [23]:
# How many rentals are there?

In [24]:
# What is the data type of rental table

In [25]:
# Convert rental date to datetime (from string)
db['rental']['rental_date'] = pd.to_datetime(db['rental']['rental_date'], errors='coerce')

In [26]:
# Convert return date to datatime (from string) ... Hint (look at the errors parameter)

In [27]:
# Add a column to the rental table noting the different in times

In [28]:
# View the rental table

In [29]:
# What's the average rental duration